# 1. Определить количество городов в файле.
# 2. Создать словарь, где ключ — это код страны, а значение — количество
# городов.
# 3. Подсчитать количество городов в северном полушарии и в южном.
# 4. Перевести в CSV файл данные по городам (координаты представить в виде
# строки значений через запятую).
# 5. Создать другой JSON файл, в который сохранить только города одной
# выбранной страны.
# 6. * Для каждой страны создать свой файл JSON с данными городов. Лучше
# создать отдельную папку в PyCharm, и указать путь к новому файлу с этой
# папкой.
